app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
      flash[:notice] = "You have created book successfully."
      # redirect_to book_path(@book)
    else
      @user = current_user
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Title 1"], ["body", "Opinion 1"], ["user_id", 1], ["created_at", "2021-03-01 07:34:21.249690"], ["updated_at", "2021-03-01 07:34:21.249690"]]
SELECT "books".* FROM "books"